## Plan Result (883: prod_ai - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 3 to change, 11 to destroy.</code></pre>

* Update
  * module.ai.azurerm_ai_foundry.ai_foundry
  * module.ai.azurerm_cognitive_account.cognitive_account
  * module.ai.azurerm_storage_account.workspace_storage_account
* Replace
  * module.ai.azurerm_machine_learning_compute_instance.compute_instance[0]
  * module.ai.azurerm_machine_learning_workspace.ml_workspace
  * module.ai.azurerm_private_endpoint.ml_private_endpoint
  * module.ai.azurerm_role_assignment.compute_blob_contributor_to_ai_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.compute_blob_contributor_to_file_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.compute_contributor_to_ai_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.compute_contributor_to_file_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.ml_blob_contributor_to_ai_storage_account
  * module.ai.azurerm_role_assignment.ml_blob_contributor_to_file_storage_account[0]
  * module.ai.azurerm_role_assignment.ml_contributor_from_to_ai_storage_account
  * module.ai.azurerm_role_assignment.ml_contributor_to_file_storage_account[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ai.azurerm_ai_foundry.ai_foundry will be updated in-place
  ~ resource "azurerm_ai_foundry" "ai_foundry" {
        id                             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ai-foundry-prod"
        name                           = "dlrm-ingest-ai-foundry-prod"
      ~ tags                           = {
          - "__SYSTEM__AIServices_Enda-m9gxngd8-uksouth"                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/Enda-m9gxngd8-uksouth" -> null
          - "__SYSTEM__AIServices_dlrm-aria-document-migration-res"       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-aria-document-migration-res" -> null
          - "__SYSTEM__AzureOpenAI_Enda-m9gxngd8-uksouth_aoai"            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/Enda-m9gxngd8-uksouth" -> null
          - "__SYSTEM__AzureOpenAI_dlrm-aria-document-migration-res_aoai" = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-aria-document-migration-res" -> null
          - "__SYSTEM__CognitiveSearch_dlrmingestprojectprod"             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Search/searchServices/dlrm-ingest-project-prod" -> null
            "application"                                                 = "dlrm-data-ingest"
            "builtFrom"                                                   = "hmcts/dlrm-data-ingest-infra"
            "businessArea"                                                = "cross-cutting"
            "criticality"                                                 = "High"
            "environment"                                                 = "production"
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_cognitive_account.cognitive_account will be updated in-place
  ~ resource "azurerm_cognitive_account" "cognitive_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-ingest-cognitive-standard-prod"
        name                               = "dlrm-ingest-cognitive-standard-prod"
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (13 unchanged attributes hidden)

      - network_acls {
          - default_action = "Allow" -> null
          - ip_rules       = [] -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ai.azurerm_machine_learning_compute_instance.compute_instance[0] must be replaced
-/+ resource "azurerm_machine_learning_compute_instance" "compute_instance" {
      ~ id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-prod/computes/dlrm-ingest-ci-prod1" -> (known after apply)
      ~ machine_learning_workspace_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-prod" -> (known after apply) # forces replacement
        name                          = "dlrm-ingest-ci-prod1"
      - subnet_resource_id            = "/subscriptions/33ad45af-0b2c-404d-b7a3-40778055f1aa/resourceGroups/commonHoboRG42/providers/Microsoft.Network/VirtualNetworks/43bd6bd1-f184-4f7a-b8a3-df8982f2f789-main/subnets/dlrm-ingest-ci-prod1" -> null # forces replacement
        tags                          = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (5 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "608496cf-eb3e-4eac-a3b7-95072d39ea64" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ai.azurerm_machine_learning_workspace.ml_workspace must be replaced
-/+ resource "azurerm_machine_learning_workspace" "ml_workspace" {
      - container_registry_id          = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.ContainerRegistry/registries/43bd6bd1f1844f7ab8a3df8982f2f789" -> null # forces replacement
      ~ discovery_url                  = "https://43bd6bd1-f184-4f7a-b8a3-df8982f2f789.workspace.uksouth.api.azureml.ms/discovery/workspaces/43bd6bd1-f184-4f7a-b8a3-df8982f2f789" -> (known after apply)
      - high_business_impact           = false -> null
      ~ id                             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-prod" -> (known after apply)
        name                           = "dlrm-ingest-ml-workspace-prod"
        tags                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ workspace_id                   = "43bd6bd1-f184-4f7a-b8a3-df8982f2f789" -> (known after apply)
        # (13 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "b2b7171a-2532-4ecd-9a22-bb5e123b9d43" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ai.azurerm_private_endpoint.ml_private_endpoint must be replaced
-/+ resource "azurerm_private_endpoint" "ml_private_endpoint" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ml-workspace-pe-prod" -> (known after apply)
        name                          = "dlrm-ingest-ml-workspace-pe-prod"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Network/networkInterfaces/dlrm-ingest-ml-workspace-pe-prod.nic.25a9c495-05c4-421e-bc3b-4d94d7a39ada"
              - name = "dlrm-ingest-ml-workspace-pe-prod.nic.25a9c495-05c4-421e-bc3b-4d94d7a39ada"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ml-workspace-pe-prod/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.api.azureml.ms"
              - name                = "privatelink.api.azureml.ms"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms"
              - record_sets         = [
                  - {
                      - fqdn         = "43bd6bd1-f184-4f7a-b8a3-df8982f2f789.workspace.uksouth.privatelink.api.azureml.ms"
                      - ip_addresses = [
                          - "10.247.43.35",
                        ]
                      - name         = "43bd6bd1-f184-4f7a-b8a3-df8982f2f789.workspace.uksouth"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "43bd6bd1-f184-4f7a-b8a3-df8982f2f789.workspace.uksouth.cert.privatelink.api.azureml.ms"
                      - ip_addresses = [
                          - "10.247.43.35",
                        ]
                      - name         = "43bd6bd1-f184-4f7a-b8a3-df8982f2f789.workspace.uksouth.cert"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "*.43bd6bd1-f184-4f7a-b8a3-df8982f2f789.inference.uksouth.privatelink.api.azureml.ms"
                      - ip_addresses = [
                          - "10.247.43.37",
                        ]
                      - name         = "*.43bd6bd1-f184-4f7a-b8a3-df8982f2f789.inference.uksouth"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
          - {
              - id                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ml-workspace-pe-prod/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.notebooks.azure.net"
              - name                = "privatelink.notebooks.azure.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ml-dlrm-ingest-ml--uksouth-43bd6bd1-f184-4f7a-b8a3-df8982f2f789.uksouth.privatelink.notebooks.azure.net"
                      - ip_addresses = [
                          - "10.247.43.36",
                        ]
                      - name         = "ml-dlrm-ingest-ml--uksouth-43bd6bd1-f184-4f7a-b8a3-df8982f2f789.uksouth"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ml-workspace-pe-prod/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "ml-workspace-psc"
          ~ private_connection_resource_id    = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-prod" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.247.43.35" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.ai.azurerm_role_assignment.compute_blob_contributor_to_ai_storage_account["dlrm-ingest-ci-prod1"] must be replaced
-/+ resource "azurerm_role_assignment" "compute_blob_contributor_to_ai_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod/providers/Microsoft.Authorization/roleAssignments/5390be7d-fd46-57a3-5a28-664b990a9f93" -> (known after apply)
      ~ name                                   = "5390be7d-fd46-57a3-5a28-664b990a9f93" -> (known after apply)
      ~ principal_id                           = "608496cf-eb3e-4eac-a3b7-95072d39ea64" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.compute_blob_contributor_to_file_storage_account["dlrm-ingest-ci-prod1"] must be replaced
-/+ resource "azurerm_role_assignment" "compute_blob_contributor_to_file_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod/providers/Microsoft.Authorization/roleAssignments/9d4091fb-8cd7-4ec7-7d17-5e36af9df2ba" -> (known after apply)
      ~ name                                   = "9d4091fb-8cd7-4ec7-7d17-5e36af9df2ba" -> (known after apply)
      ~ principal_id                           = "608496cf-eb3e-4eac-a3b7-95072d39ea64" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.compute_contributor_to_ai_storage_account["dlrm-ingest-ci-prod1"] must be replaced
-/+ resource "azurerm_role_assignment" "compute_contributor_to_ai_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod/providers/Microsoft.Authorization/roleAssignments/dee96da4-93d0-c6c7-9bab-cc9157dc0cf4" -> (known after apply)
      ~ name                                   = "dee96da4-93d0-c6c7-9bab-cc9157dc0cf4" -> (known after apply)
      ~ principal_id                           = "608496cf-eb3e-4eac-a3b7-95072d39ea64" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.compute_contributor_to_file_storage_account["dlrm-ingest-ci-prod1"] must be replaced
-/+ resource "azurerm_role_assignment" "compute_contributor_to_file_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod/providers/Microsoft.Authorization/roleAssignments/064b878c-8f30-cc08-9ee8-95ee4e240265" -> (known after apply)
      ~ name                                   = "064b878c-8f30-cc08-9ee8-95ee4e240265" -> (known after apply)
      ~ principal_id                           = "608496cf-eb3e-4eac-a3b7-95072d39ea64" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.ml_blob_contributor_to_ai_storage_account must be replaced
-/+ resource "azurerm_role_assignment" "ml_blob_contributor_to_ai_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod/providers/Microsoft.Authorization/roleAssignments/7b7e7a89-b798-43c3-72f3-c3e04854eec7" -> (known after apply)
      ~ name                                   = "7b7e7a89-b798-43c3-72f3-c3e04854eec7" -> (known after apply)
      ~ principal_id                           = "b2b7171a-2532-4ecd-9a22-bb5e123b9d43" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.ml_blob_contributor_to_file_storage_account[0] must be replaced
-/+ resource "azurerm_role_assignment" "ml_blob_contributor_to_file_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod/providers/Microsoft.Authorization/roleAssignments/0f71b884-1a74-7859-560e-18a3ceee23b4" -> (known after apply)
      ~ name                                   = "0f71b884-1a74-7859-560e-18a3ceee23b4" -> (known after apply)
      ~ principal_id                           = "b2b7171a-2532-4ecd-9a22-bb5e123b9d43" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.ml_contributor_from_to_ai_storage_account must be replaced
-/+ resource "azurerm_role_assignment" "ml_contributor_from_to_ai_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod/providers/Microsoft.Authorization/roleAssignments/e5393bce-48d9-c0cc-186d-39761aec95ab" -> (known after apply)
      ~ name                                   = "e5393bce-48d9-c0cc-186d-39761aec95ab" -> (known after apply)
      ~ principal_id                           = "b2b7171a-2532-4ecd-9a22-bb5e123b9d43" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.ml_contributor_to_file_storage_account[0] must be replaced
-/+ resource "azurerm_role_assignment" "ml_contributor_to_file_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod/providers/Microsoft.Authorization/roleAssignments/6dfb010c-8c0a-c2d2-845e-53c15c1bf3eb" -> (known after apply)
      ~ name                                   = "6dfb010c-8c0a-c2d2-845e-53c15c1bf3eb" -> (known after apply)
      ~ principal_id                           = "b2b7171a-2532-4ecd-9a22-bb5e123b9d43" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_storage_account.workspace_storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "workspace_storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
        name                               = "dlrmingestaisaprod"
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 11 to add, 3 to change, 11 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":105,"Program":"tfcmt","SHA1":"","Target":"883: prod_ai - TerraformPlanApply","Vars":{}} -->